# простые типы данных
# динамическая тиризация - тип данных, кот определяется в момент выполнения программы

# age = 33 # int = целое число
# name = 'jon' # str = строка
# height = 1.75 #  float = числа с плавающей точкой
# is_student = True # bool = boolean = логический тип данных, только True or False

# True == 1
# False == 0

# int()
# str()
# float()
# bool()

# print(type(is_student)) # оператор type() позволяет узнать тип данных

# h = str(33.3) # конвертирование типов данных
# g = int(33.3)
# print(h)


# num = int(input('Введите число: '))
# result = 52 // num # // целостное деление не показывает остаток, % показывает остаток при делении, 
# # ** квадрат числа
# print(result)


# > оператор больше
# < оператор меньше
# >= оператор больше или равно
# <= оператор меньше или равно
# == оператор равенство
# != оператор неравенство
# = оператор присваивания

# print(bool(1)) 
